// -----// IR Dump After StablehloLegalizeToHloPass (stablehlo-legalize-to-hlo) //----- //
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
    %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
    return %1 : tensor<512x256xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After LegalizeControlFlowPass (mhlo-legalize-control-flow) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After TopLevelSCFToCFG (iree-top-level-scf-to-cfg) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After MHLOToMHLOPreprocessing (iree-mhlo-to-mhlo-preprocessing) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After ShapeToShapeLowering (shape-to-shape-lowering) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After ConvertShapeToStandard (convert-shape-to-std) //----- //
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
    %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
    return %1 : tensor<512x256xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After Inliner (inline) //----- //
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
    %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
    return %1 : tensor<512x256xf32>
  }
}


// -----// IR Dump After DemoteI64ToI32 (iree-util-demote-i64-to-i32) //----- //
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
    %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
    return %1 : tensor<512x256xf32>
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
    %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
    return %1 : tensor<512x256xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After CSE (cse) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After HloLegalizeShapeComputationsPass (hlo-legalize-shape-computations) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After ConvertMHLOToLinalgExt (iree-mhlo-to-linalg-ext) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = mhlo.add %arg0, %arg1 : tensor<512x256xf32>
  %1 = mhlo.add %0, %arg2 : tensor<512x256xf32>
  return %1 : tensor<512x256xf32>
}

// -----// IR Dump After ConvertMHLOToLinalgOnTensors (iree-mhlo-to-linalg-on-tensors) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After ReconcileUnrealizedCasts (reconcile-unrealized-casts) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = tensor.empty() : tensor<512x256xf32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %4 = arith.addf %in, %in_0 : f32
    linalg.yield %4 : f32
  } -> tensor<512x256xf32>
  %2 = tensor.empty() : tensor<512x256xf32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %4 = arith.addf %in, %in_0 : f32
    linalg.yield %4 : f32
  } -> tensor<512x256xf32>
  return %3 : tensor<512x256xf32>
}

// -----// IR Dump After VerifyCompilerMHLOInputLegality (iree-mhlo-verify-compiler-input-legality) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After IREEImportPublic (iree-import-public) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After ImportMLProgram (iree-import-ml-program) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After SanitizeModuleNames (iree-sanitize-module-names) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After mlir::iree_compiler::IREE::ABI::WrapEntryPointsPass (iree-abi-wrap-entry-points) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = call @_twoadd_static(%0, %1, %2) : (tensor<512x256xf32>, tensor<512x256xf32>, tensor<512x256xf32>) -> tensor<512x256xf32>
    %4 = hal.tensor.export %3 : tensor<512x256xf32> -> !hal.buffer_view
    return %4 : !hal.buffer_view
  }
  func.func private @_twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
    %0 = tensor.empty() : tensor<512x256xf32>
    %1 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    %2 = tensor.empty() : tensor<512x256xf32>
    %3 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %4 = arith.addf %in, %in_0 : f32
      linalg.yield %4 : f32
    } -> tensor<512x256xf32>
    return %3 : tensor<512x256xf32>
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func private @_twoadd_static(%arg0: tensor<512x256xf32>, %arg1: tensor<512x256xf32>, %arg2: tensor<512x256xf32>) -> tensor<512x256xf32> {
  %0 = tensor.empty() : tensor<512x256xf32>
  %1 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%arg0, %arg1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%0 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %4 = arith.addf %in, %in_0 : f32
    linalg.yield %4 : f32
  } -> tensor<512x256xf32>
  %2 = tensor.empty() : tensor<512x256xf32>
  %3 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%1, %arg2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%2 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %4 = arith.addf %in, %in_0 : f32
    linalg.yield %4 : f32
  } -> tensor<512x256xf32>
  return %3 : tensor<512x256xf32>
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = call @_twoadd_static(%0, %1, %2) : (tensor<512x256xf32>, tensor<512x256xf32>, tensor<512x256xf32>) -> tensor<512x256xf32>
  %4 = hal.tensor.export %3 : tensor<512x256xf32> -> !hal.buffer_view
  return %4 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %8 = arith.addf %in, %in_0 : f32
    linalg.yield %8 : f32
  } -> tensor<512x256xf32>
  %5 = tensor.empty() : tensor<512x256xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%5 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %8 = arith.addf %in, %in_0 : f32
    linalg.yield %8 : f32
  } -> tensor<512x256xf32>
  %7 = hal.tensor.export %6 : tensor<512x256xf32> -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After Inliner (inline) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %8 = arith.addf %in, %in_0 : f32
      linalg.yield %8 : f32
    } -> tensor<512x256xf32>
    %5 = tensor.empty() : tensor<512x256xf32>
    %6 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%5 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %8 = arith.addf %in, %in_0 : f32
      linalg.yield %8 : f32
    } -> tensor<512x256xf32>
    %7 = hal.tensor.export %6 : tensor<512x256xf32> -> !hal.buffer_view
    return %7 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %8 = arith.addf %in, %in_0 : f32
    linalg.yield %8 : f32
  } -> tensor<512x256xf32>
  %5 = tensor.empty() : tensor<512x256xf32>
  %6 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%5 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %8 = arith.addf %in, %in_0 : f32
    linalg.yield %8 : f32
  } -> tensor<512x256xf32>
  %7 = hal.tensor.export %6 : tensor<512x256xf32> -> !hal.buffer_view
  return %7 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After SymbolDCE (symbol-dce) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After DemoteF64ToF32 (iree-util-demote-f64-to-f32) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After DetachElementwiseFromNamedOps (iree-flow-detach-elementwise-from-named-ops) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After LinalgNamedOpConversion (linalg-named-op-conversion) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After Convert1X1FilterConv2DToMatmul (iree-flow-convert-1x1-filter-conv2d-to-matmul) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After VerifyInputLegality (iree-verify-input-legality) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After ExpandTensorShapes (iree-flow-expand-tensor-shapes) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After SimplifyGlobalAccesses (iree-util-simplify-global-accesses) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After ApplyPatterns (iree-util-apply-patterns) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After FoldGlobals (iree-util-fold-globals) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After IPO (iree-util-ipo) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module attributes {iree.fixedpoint.iteration = 0 : index} {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After CSE (cse) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After FixedPointIterator (iree-util-fixed-point-iterator) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After TensorPadToTensorInsertSlice (iree-flow-tensor-pad-to-tensor-insert-slice) //----- //
#map = affine_map<(d0, d1) -> (d0, d1)>
module {
  func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
    %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
    %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
    %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
    %3 = tensor.empty() : tensor<512x256xf32>
    %4 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %5 = linalg.generic {indexing_maps = [#map, #map, #map], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
    ^bb0(%in: f32, %in_0: f32, %out: f32):
      %7 = arith.addf %in, %in_0 : f32
      linalg.yield %7 : f32
    } -> tensor<512x256xf32>
    %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
    return %6 : !hal.buffer_view
  }
}


// -----// IR Dump After ConvertElementwiseToLinalg (convert-elementwise-to-linalg) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After LinalgFoldUnitExtentDims (linalg-fold-unit-extent-dims) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After InterchangeGenericOps (iree-flow-interchange-generic-ops) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After ResolveShapedTypeResultDims (resolve-shaped-type-result-dims) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %5 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%4, %2 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
  %6 = hal.tensor.export %5 : tensor<512x256xf32> -> !hal.buffer_view
  return %6 : !hal.buffer_view
}

// -----// IR Dump After Canonicalizer (canonicalize) //----- //
func.func @twoadd_static(%arg0: !hal.buffer_view, %arg1: !hal.buffer_view, %arg2: !hal.buffer_view) -> !hal.buffer_view attributes {iree.abi.stub} {
  %0 = hal.tensor.import %arg0 : !hal.buffer_view -> tensor<512x256xf32>
  %1 = hal.tensor.import %arg1 : !hal.buffer_view -> tensor<512x256xf32>
  %2 = hal.tensor.import %arg2 : !hal.buffer_view -> tensor<512x256xf32>
  %3 = tensor.empty() : tensor<512x256xf32>
  %4 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%0, %1 : tensor<512x256xf32>, tensor<512x256xf32>) outs(%3 : tensor<512x256xf32>) {
  ^bb0(%in: f32, %in_0: f32, %out: f32):
    %7 = arith.addf %in, %in_0 : f32
    linalg.yield %7 : f32
  } -> tensor<512x256xf32>
